app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM (SELECT  1 AS one FROM "posts" ORDER BY "posts"."created_at" DESC LIMIT ? OFFSET ?) subquery_for_count  [["LIMIT", 10], ["OFFSET", 0]]
---
	def index
    #@posts = Post.all
		@posts = Post.order(created_at: :desc).page(params[:page])